In [1]:
import pandas as pd

## Q1

In [2]:
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
a= [ 'a','b','c','d','e','f']

## Q2

In [4]:
data_var = ['Data science' , 'matchine learning' , 'pandas','numpy' , "jpmorgan" ,'kpmg' , 'motherson' , 'morgan stanle' , 'tata group' ,'adani']

In [5]:
series1 = pd.Series(data_var)

In [6]:
series1

0         Data science
1    matchine learning
2               pandas
3                numpy
4             jpmorgan
5                 kpmg
6            motherson
7        morgan stanle
8           tata group
9                adani
dtype: object

## Q3

In [7]:
data3 = {'Name' :['Alice' , ' Bob' , 'Claire'],
         'Age' : [ 25, 30 , 27],
        'Gender' : [ 'Female' , 'Male' , 'Female']}

In [8]:
data_frame =pd.DataFrame(data3)
data_frame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4

1.DataFrame- it refers to the represent od 2d data in tabular form 
for ex-

In [9]:
data_2 = {"Name" :['arko' ,'deepak' ,'vivek','vipin'],
          "age" :[25 ,22 ,22 ,21 ],
          "address": ["bengal" , "meerut" , "meerut" , "riwadi"]}

In [10]:
data_fame =pd.DataFrame(data_2)

In [11]:
data_fame

     Name  age address
0    arko   25  bengal
1  deepak   22  meerut
2   vivek   22  meerut
3   vipin   21  riwadi

2.Series- it refers to the data series by the list

In [12]:
#example- 
data_series= [ 1, 2,3,4,5,6]
pd.Series(data_series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

## Q5

In [96]:
#.drop - drop funcion in pandas used to delete the colum or row of the data 
data_fame.drop("age",axis =1)

       address
Name
arko    bengal
deepak  meerut
vivek   meerut
vipin   riwadi

In [99]:
a=data_fame.drop('age', axis=1)

In [98]:
data_fame

        age address
Name
arko     25  bengal
deepak   22  meerut
vivek    22  meerut
vipin    21  riwadi

In [16]:
a

     Name address
0    arko  bengal
1  deepak  meerut
2   vivek  meerut
3   vipin  riwadi

In [18]:
data_fame.drop(1)

    Name  age address
0   arko   25  bengal
2  vivek   22  meerut
3  vipin   21  riwadi

In [32]:
#.set_index - it can set the index which you want
data_fame.set_index('Name',inplace= True)

In [25]:
data_fame

        age address
Name
arko     25  bengal
deepak   22  meerut
vivek    22  meerut
vipin    21  riwadi

In [23]:
data_fame.drop('vivek')

        age address
Name
arko     25  bengal
deepak   22  meerut
vipin    21  riwadi

In [40]:
#.reset_index- it rearrange the index to defalt
data_fame.reset_index(inplace= True)

In [41]:
data_fame

   level_0  index    Name  age address
0        0      0    arko   25  bengal
1        1      1  deepak   22  meerut
2        2      2   vivek   22  meerut
3        3      3   vipin   21  riwadi

In [46]:
data_fame.set_index('Name',inplace = True)

In [58]:
data_fame

        age address
Name
arko     25  bengal
deepak   22  meerut
vivek    22  meerut
vipin    21  riwadi

In [57]:
data_fame

        age address
Name
arko     25  bengal
deepak   22  meerut
vivek    22  meerut
vipin    21  riwadi

## Q6

1. series & panel are immutable 
2. dataframe are mutable

## Q7

In [65]:
s1 = ['a','b','c','d','e']
s2= [ 1,2,3,4,5]
s3 = [ 10,13,15,16,18]

In [81]:
s1=pd.Series(s1,name= 's1')

In [82]:
s2=pd.Series(s2,name= 's2')

In [83]:
s3=pd.Series(s3, name= 's3')

In [87]:
a=pd.concat([s1,s2,s3],axis =1)

In [88]:
a

  s1  s2  s3
0  a   1  10
1  b   2  13
2  c   3  15
3  d   4  16
4  e   5  18